In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
# id = db.Column("room_id", db.Integer, primary_key=True)
#     room = Column(db.Integer, nullable=False)
#     number_person = Column(db.Integer, nullable=False)
#     type_room = Column(String(250), nullable=False)
#     price_room = Column(db.Integer, nullable=False)
#     position_room = Column(String(250), nullable=False)
#     status_room = Column(String(250), nullable=False)

In [3]:
room = []
for i in range(1,6):
    room+= [k for k in range(i*100+1, 100*i+30)] + [j for j in range(i*100+60,100*i+90)]

In [4]:
df = pd.DataFrame({'room':room})
df['price_room'] = 670
df['numberDomitory'] = 1
df['type_room'] = 'NORM'
df['number_person'] = df['room'].apply(lambda x: 2 if x%2 else 3)
df['gender'] = df['room'].apply(lambda x: 'MALE' if x%2 else 'FEMALE')
df['empty_position'] =  df['number_person']
df['status_room'] = 'OK'

In [5]:
df.head()

,room,price_room,numberDomitory,type_room,number_person,gender,empty_position,status_room
0,101,670,1,NORM,2,MALE,2,OK
1,102,670,1,NORM,3,FEMALE,3,OK
2,103,670,1,NORM,2,MALE,2,OK
3,104,670,1,NORM,3,FEMALE,3,OK
4,105,670,1,NORM,2,MALE,2,OK

In [6]:
room = []
for i in range(1,6):
    room+= [k for k in range(1000+ i*100+1, 1000+100*i+30)]

In [7]:
df_block = pd.DataFrame({'room':room})
df_block['price_room'] = 1200
df_block['numberDomitory'] = 1
df_block['type_room'] = 'BLOCK'
df_block['number_person'] = 2
df_block['gender'] = df_block['room'].apply(lambda x: 'MALE' if x%2 else 'FEMALE')
df_block['empty_position'] =  df_block['number_person']
df_block['status_room'] = 'OK'

In [8]:
df_block.head()

,room,price_room,numberDomitory,type_room,number_person,gender,empty_position,status_room
0,1101,1200,1,BLOCK,2,MALE,2,OK
1,1102,1200,1,BLOCK,2,FEMALE,2,OK
2,1103,1200,1,BLOCK,2,MALE,2,OK
3,1104,1200,1,BLOCK,2,FEMALE,2,OK
4,1105,1200,1,BLOCK,2,MALE,2,OK

In [9]:
df = pd.concat([df, df_block])

In [10]:
df.sample(20)

,room,price_room,numberDomitory,type_room,number_person,gender,empty_position,status_room
144,327,670,1,NORM,2,MALE,2,OK
70,212,670,1,NORM,3,FEMALE,3,OK
74,216,670,1,NORM,3,FEMALE,3,OK
113,1427,1200,1,BLOCK,2,MALE,2,OK
138,321,670,1,NORM,2,MALE,2,OK
120,1505,1200,1,BLOCK,2,MALE,2,OK
2,103,670,1,NORM,2,MALE,2,OK
116,288,670,1,NORM,3,FEMALE,3,OK
25,126,670,1,NORM,3,FEMALE,3,OK
15,1116,1200,1,BLOCK,2,FEMALE,2,OK
141,324,670,1,NORM,3,FEMALE,3,OK
182,406,670,1,NORM,3,FEMALE,3,OK
5,106,670,1,NORM,3,FEMALE,3,OK
67,209,670,1,NORM,2,MALE,2,OK
158,371,670,1,NORM,2,MALE,2,OK
164,377,670,1,NORM,2,MALE,2,OK
277,572,670,1,NORM,3,FEMALE,3,OK
120,303,670,1,NORM,2,MALE,2,OK
220,474,670,1,NORM,3,FEMALE,3,OK
290,585,670,1,NORM,2,MALE,2,OK

In [11]:
df2 = df.copy()
df2['numberDomitory'] = 2
df3 = df.copy()
df3['numberDomitory'] = 3

In [12]:
df = pd.concat([df, df2,df3])

In [13]:
df['room_id'] = range(len(df))

In [14]:
df.sample(20)

,room,price_room,numberDomitory,type_room,number_person,gender,empty_position,status_room,room_id
89,1403,1200,2,BLOCK,2,MALE,2,OK,824
28,1129,1200,2,BLOCK,2,MALE,2,OK,763
109,1423,1200,2,BLOCK,2,MALE,2,OK,844
28,129,670,2,NORM,2,MALE,2,OK,468
88,1402,1200,1,BLOCK,2,FEMALE,2,OK,383
54,185,670,1,NORM,2,MALE,2,OK,54
134,317,670,1,NORM,2,MALE,2,OK,134
16,1117,1200,1,BLOCK,2,MALE,2,OK,311
59,1302,1200,2,BLOCK,2,FEMALE,2,OK,794
15,116,670,3,NORM,3,FEMALE,3,OK,895
104,1418,1200,1,BLOCK,2,FEMALE,2,OK,399
203,427,670,3,NORM,2,MALE,2,OK,1083
55,1227,1200,3,BLOCK,2,MALE,2,OK,1230
224,478,670,1,NORM,3,FEMALE,3,OK,224
176,389,670,2,NORM,2,MALE,2,OK,616
118,301,670,1,NORM,2,MALE,2,OK,118
164,377,670,3,NORM,2,MALE,2,OK,1044
98,270,670,1,NORM,3,FEMALE,3,OK,98
257,522,670,1,NORM,3,FEMALE,3,OK,257
200,424,670,3,NORM,3,FEMALE,3,OK,1080

In [15]:
from sqlalchemy import create_engine

disk_engine = create_engine('sqlite:///rooms.sqlite')
df.to_sql(name='rooms', con=disk_engine,if_exists='append',  index=False)

In [16]:
!pip install sqlalchemy

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: sqlalchemy in /home/manhlab/.local/lib/python3.8/site-packages (1.3.20)